# Updating Values Into Using Pandas

> Alter Rows  and columns How to do that

> Importing the Pandas Library

Since its a intro one use of dictionary only..

In [151]:
import pandas as pd

In [152]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [153]:
df = pd.DataFrame(people)

In [154]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

# Updating The Columns

> rename columns <code> df.columns = ['first_name' , 'last_name' , 'email'] </code>

In [155]:
df.columns = ['first_name' , 'last_name' , 'email']

> as in code below columns name are changed

In [156]:
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

## Removing space in some column name changing it to Lower case or upper case etc

> can use list comprehension to make it upper case for making columns heading to upper case

In [157]:
df.columns = [x.upper() for x in df.columns]

In [158]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

> reeplacing Places with Under Scores

In [159]:
df.columns = df.columns.str.replace(' ' , '_')

In [160]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [161]:
#df.columns = df.columns.str.replace('_' , ' ')

In [162]:
df

  FIRST_NAME LAST_NAME                    EMAIL
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

> <code> df.rename(columns = 'FIRST_NAME':'first') </code> df.rename have dictionary as argument in which key is previous value and its value is the new updated one

In [163]:
df.rename(columns = {'FIRST_NAME':'first' , 'LAST_NAME':'last' , 'EMAIL':'email'} , inplace = True)

In [164]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

#  Updating The Values In Rows

> update a single value changing doe to smith so grab row by <code> df.loc[2] </code>

In [165]:
df.loc[2]

first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2, dtype: object

> passing whole list of values <code> df.loc[2] = ['Jhon' , 'Smith' , 'JohnSmiith@email.com'] </code>

In [166]:
df.loc[2] = ['Jhon' , 'Smith' , 'JohnSmiith@email.com']

In [167]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   Jhon    Smith     JohnSmiith@email.com

> change first and email only then like two dimensuional array selecting it <code> df.loc[2 , ['first' , 'email']] = ['Gerald'  , GeraldSmith@email.com] </code>

In [168]:
df.loc[2 , ['first' , 'email']] = ['Gerald'  , 'GeraldSmith@email.com']

In [169]:
df

    first     last                    email
0   Corey  Schafer  CoreyMSchafer@gmail.com
1    Jane      Doe        JaneDoe@email.com
2  Gerald    Smith    GeraldSmith@email.com

> change single value

In [170]:
df.loc[2 , 'last'] = 'Doe'

In [171]:
df

    first     last                    email
0   Corey  Schafer  CoreyMSchafer@gmail.com
1    Jane      Doe        JaneDoe@email.com
2  Gerald      Doe    GeraldSmith@email.com

> lets change email to GeraldSmith@email.com to GeraldDoe@email.com we can do by applying filter

In [172]:
filt = (df['email'] == 'GeraldSmith@email.com')

In [173]:
df[filt]

    first last                  email
2  Gerald  Doe  GeraldSmith@email.com

> we can access the email col by <code> df[filt]['email'] </code> like <code> arr[i][j]</code>

In [174]:
df[filt]['email'] = 'GeraldDoe@email.com'

c:\python36\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

> above erroe comes because literally due to complex operation itis confused whther pandas return a df or series moral of story use only loc and at to update the values thats all remember BC :-{

In [175]:
df.loc[filt ,'email'] = 'GeraldDoe@email.com'

In [176]:
df

    first     last                    email
0   Corey  Schafer  CoreyMSchafer@gmail.com
1    Jane      Doe        JaneDoe@email.com
2  Gerald      Doe      GeraldDoe@email.com

## Change values in multiple rows how to do that

> in below code it only make changes does not aasighn it to do that we need to do it diffrent like

In [177]:
df['email'].str.lower()

0    coreymschafer@gmail.com
1          janedoe@email.com
2        geralddoe@email.com
Name: email, dtype: object

In [178]:
df

    first     last                    email
0   Corey  Schafer  CoreyMSchafer@gmail.com
1    Jane      Doe        JaneDoe@email.com
2  Gerald      Doe      GeraldDoe@email.com

In [179]:
df['email']  = df['email'].str.lower()

In [180]:
df

    first     last                    email
0   Corey  Schafer  coreymschafer@gmail.com
1    Jane      Doe        janedoe@email.com
2  Gerald      Doe      geralddoe@email.com

# There are four methods for changing multiple rows one by one
<br></br>
<li>Apply</li>
<li>Map</li>
<li>Applymap</li>
<li>Replace</li>

## Apply

> Apply Works on both series and Dataframes and work diffrently on each

# getting len of all string in email col (Apply on Series)

In [181]:
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

> can be used for getting info about data and also help in updating the data

In [182]:
def email_uppercase(email):
    return email.upper()

In [183]:
def email_lowercase(email):
    return email.lower()

In [184]:
df['email'].apply(email_uppercase)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2        GERALDDOE@EMAIL.COM
Name: email, dtype: object

In [185]:
df['email'] = df['email'].str.lower()

In [186]:
df

    first     last                    email
0   Corey  Schafer  coreymschafer@gmail.com
1    Jane      Doe        janedoe@email.com
2  Gerald      Doe      geralddoe@email.com

In [187]:
df['email'] = df['email'].apply(lambda x: x.upper())

In [188]:
df

    first     last                    email
0   Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1    Jane      Doe        JANEDOE@EMAIL.COM
2  Gerald      Doe      GERALDDOE@EMAIL.COM

# Apply on DataFrame

> Here it shoows the value in each email string len

In [189]:
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

> if we apply on dataframe like <code>df.apply(len)</code> it shows each col length like first has 3 , last has 3 and email has 3 values count of each col

In [190]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [191]:
len(df['email'])

3

### Imp  <code>df.apply(len , axis = 'columns')</code> here we change axis then it shows ike in horizontal o row has 3 <br></br> <br></br> values 'corey' , 'schaufer','CoreyShaufer@email.com' and so as 1 and 2 nd row vice vers

In [192]:
df.apply(len , axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [193]:
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    COREYMSCHAFER@GMAIL.COM
dtype: object

## Apply Map

>Apply Map is used to access each individual element. Series Object does not have ApplyMap Method

In [194]:
df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      6     3     19

> As we see above applymap apply len fun on all the values in df as apply on on series or whole row or column

In [195]:
df.applymap(str.lower )

    first     last                    email
0   corey  schafer  coreymschafer@gmail.com
1    jane      doe        janedoe@email.com
2  gerald      doe      geralddoe@email.com

# Map

> Substitute a couple of first name

In [196]:
df

    first     last                    email
0   Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1    Jane      Doe        JANEDOE@EMAIL.COM
2  Gerald      Doe      GERALDDOE@EMAIL.COM

In [197]:
df['first'].map({'Corey':'irshad' , 'Jane':'samir'})

0    irshad
1     samir
2       NaN
Name: first, dtype: object

> Here we have nan for those value which is not substituted

In [198]:
df

    first     last                    email
0   Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1    Jane      Doe        JANEDOE@EMAIL.COM
2  Gerald      Doe      GERALDDOE@EMAIL.COM

> As Above we have first NaN is replaced in the first col  then we have another method called Replace.

# Replace

>inplace works with replace but does

In [199]:
df['first'] = df['first'].replace({'irshad':'Corey' , 'samir':'Jane' , 'Nan':'Jhon'})

In [200]:
df

    first     last                    email
0   Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1    Jane      Doe        JANEDOE@EMAIL.COM
2  Gerald      Doe      GERALDDOE@EMAIL.COM